In [27]:
# Load packages  
import numpy as np
import pandas as pd  
import seaborn as sns

In [2]:
data_default = pd.read_excel("../data/default of credit card clients.xls", header= 1, index_col= 0)
data_default.rename(columns={'default payment next month': 'default_next_month' }, inplace=True)

In [10]:
data_default.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default_next_month
ID,,,,,,,,,,,,,,,,,,,,,
1,20000,2,2,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,1
2,120000,2,2,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,90000,2,2,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,50000,2,2,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
5,50000,1,2,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

#### Data Set Information  

`list(data_default.columns)`  

**Target Variable**  
- `default_next_month`  
  - `1`: Yes  
  - `0`: No  
  
**Explanatory Variables**  
- `LIMIT_BAL`  
  - Amount of given credit (Numeric)
- `SEX`  
  - Gender (Binary)  
    - `1`: male  
    - `2`: female
- `EDUCATION`  
  - Level of education (Categorical)  
    - `1`: Graduate school  
    - `2`: University  
    - `3`: High School  
    - `4`: Other  
- `MARRIAGE`  
  - Marital Status (Categorical)  
    - `1`: Married  
    - `2`: Single  
    - `3`: Other     
- `AGE`  (Numeric)  

*`PAY_X` (Categorial)*
- `PAY_0`  
  - Repayment status in September
- `PAY_2`  
  - Repayment status in August  
- `PAY_3`  
  - Repayment status in July  
- `PAY_4`  
  - Repayment status in June  
- `PAY_5`  
  - Repayment status in May  
- `PAY_6`  
  - Repayment status in April  
  
  
    - `-1`: pay duly  
    - `1`: payment delayed 1 month  
    - `2`: payment delayed 2 months
    -  `...`  
    - `9`: payment delayed 9 months or more  

*`BILL_AMTX` (Numeric)*  
- `BILL_AMT1`  
  - Bill amount in September  
- `BILL_AMT2`  
  - Bill amount in August  
- `BILL_AMT3`  
  - Bill amount in July  
- `BILL_AMT4`  
  - Bill amount in June  
- `BILL_AMT5`  
  - Bill amount in May  
- `BILL_AMT6`  
  - Bill amount in April  
  
*`PAY_AMTX` (Numeric)*
- `PAY_AMT1`  
  - Amount paid in September  
- `PAY_AMT2`  
  - Amount paid in August  
- `PAY_AMT3`  
  - Amount paid in July  
- `PAY_AMT4`  
  - Amount paid in June  
- `PAY_AMT5`  
  - Amount paid in May  
- `PAY_AMT6`  
  - Amount paid in April

In [73]:
default_bal = pd.DataFrame(data_default['default_next_month'].value_counts())
default_bal['Proportion'] = default_bal['default_next_month'] / np.sum(default_bal['default_next_month'])
default_bal

   default_next_month  Proportion
0               23364      0.7788
1                6636      0.2212

- Unbalanced data set, signifacntly more customers who do not default compared to those that do default (Approx 3:1)